; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c2-s8-p2-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 
          t0 t1 t2 t3 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l0-6 l0-7 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l1-6 l1-7 
          p0 p1 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l0-6)
    (in-city  l0-6 c0)
    (LOCATION l0-7)
    (in-city  l0-7 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l1-6)
    (in-city  l1-6 c1)
    (LOCATION l1-7)
    (in-city  l1-7 c1)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (OBJ p0)
    (OBJ p1)
    (at t0 l0-0)
    (at t1 l1-3)
    (at t2 l1-3)
    (at t3 l1-1)
    (at p0 l1-0)
    (at p1 l1-1)
    (at a0 l1-0)
    (at a1 l1-0)
    (at a2 l0-0)
)
(:goal
    (and
        (at p0 l1-3)
        (at p1 l0-7)
    )
)
)

; plan
1. (load-truck p1 t3 l1-1)
   deleted: (at p1 l1-1)
   added: (in p1 t3)
   goals met: 0 of 2
2. (drive-truck t3 l1-1 l1-0 c1)
   deleted: (at t3 l1-1)
   added: (at t3 l1-0)
   goals met: 0 of 2
3. (unload-truck p1 t3 l1-0)
   deleted: (in p1 t3)
   added: (at p1 l1-0)
   goals met: 0 of 2
4. (load-truck p0 t3 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t3)
   goals met: 0 of 2
5. (drive-truck t3 l1-0 l1-3 c1)
   deleted: (at t3 l1-0)
   added: (at t3 l1-3)
   goals met: 0 of 2
6. (load-airplane p1 a0 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a0)
   goals met: 0 of 2
7. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 2
8. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 0 of 2
9. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 0 of 2
10. (drive-truck t0 l0-0 l0-7 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-7)
   goals met: 0 of 2
11. (unload-truck p0 t3 l1-3)
   deleted: (in p0 t3)
   added: (at p0 l1-3)
   goals met: 1 of 2
12. (unload-truck p1 t0 l0-7)
   deleted: (in p1 t0)
   added: (at p1 l0-7)
   goals met: 2 of 2
